export type FarshRule = {
  ayah: number;
  hafs: string;
  warsh: string;
  rule: string;
};

export const quranFarsh: Record<string, FarshRule[]> = {
  "الفاتحة": [
  {
    "ayah": 4,
    "hafs": "مَالِكِ",
    "warsh": "مَلِكِ",
    "rule": "بدون ألف"
  }
],
  "آل عمران": [
  {
    "ayah": 3,
    "hafs": "التَّوْرَاةَ",
    "warsh": "التَّوْرٰةَ",
    "rule": "تقليل فتحة الراء والألف"
  },
  {
    "ayah": 4,
    "hafs": "هُدًى",
    "warsh": "هُدًى",
    "rule": "وقفا وجهان: 1. الفتح 2. التقليل"
  },
  {
    "ayah": 5,
    "hafs": "يَخْفَىٰ",
    "warsh": "يَخْفَىٰ",
    "rule": "وجهان: 1. الفتح 2. التقليل"
  },
  {
    "ayah": 6,
    "hafs": "يُصَوِّرُكُمْ",
    "warsh": "يُصَوِّرُكُمْ",
    "rule": "ترقيق الراء"
  },
  {
    "ayah": 7,
    "hafs": "تَأْوِيلِهِ",
    "warsh": "تَاوِيلِهِ",
    "rule": "إبدال الهمزة ألفا (الموضعين)"
  },
  {
    "ayah": 10,
    "hafs": "النَّارِ",
    "warsh": "النَّارِ",
    "rule": "تقليل فتحة النون والألف"
  },
  {
    "ayah": 12,
    "hafs": "وَبِئْسَ",
    "warsh": "وَبِيسَ",
    "rule": "إبدال الهمزة ياء"
  },
  {
    "ayah": 13,
    "hafs": "وَأُخْرَىٰ",
    "warsh": "وَأُخْرَىٰ",
    "rule": "تقليل فتحة الراء والألف"
  },
  {
    "ayah": 13,
    "hafs": "كَافِرَةٌ",
    "warsh": "كَافِرَةٌ",
    "rule": "ترقيق الراء"
  },
  {
    "ayah": 13,
    "hafs": "يَرَوْنَهُم",
    "warsh": "تَرَوْنَهُم",
    "rule": "بالتاء بدل الياء"
  },
  {
    "ayah": 13,
    "hafs": "يُؤَيِّدُ",
    "warsh": "يُويِّدُ",
    "rule": "إبدال الهمزة واوا مفتوحة"
  },
  {
    "ayah": 13,
    "hafs": "يَشَاءُ ۗ إِنَّ",
    "warsh": "يَشَاءُ ۗ إِنَّ",
    "rule": "وجهان: 1. إبدال الهمزة الثانية واوا مكسورة 2. تسهيلها بين الهمزة والياء"
  },
  {
    "ayah": 13,
    "hafs": "لَعِبْرَةً",
    "warsh": "لَعِبْرَةً",
    "rule": "ترقيق الراء"
  },
  {
    "ayah": 13,
    "hafs": "الْأَبْصَارِ",
    "warsh": "الَابْصَارِ",
    "rule": "نقل وتقليل فتحة الصاد والألف"
  },
  {
    "ayah": 14,
    "hafs": "الدُّنْيَا",
    "warsh": "الدُّنْيَا",
    "rule": "وجهان: 1. الفتح 2. التقليل"
  },
  {
    "ayah": 15,
    "hafs": "قُلْ أَؤُنَبِّئُكُم",
    "warsh": "قُلَ اَؤُنَبِّئُكُم",
    "rule": "نقل ثم تسهيل الهمزة الثانية"
  },
  {
    "ayah": 15,
    "hafs": "بَصِيرٌ",
    "warsh": "بَصِيرٌ",
    "rule": "ترقيق الراء وصلا ووقفا"
  },
  {
    "ayah": 16,
    "hafs": "النَّارِ",
    "warsh": "النَّارِ",
    "rule": "تقليل فتحة النون والألف"
  },
  {
    "ayah": 17,
    "hafs": "بِالْأَسْحَارِ",
    "warsh": "بِالَاسْحَارِ",
    "rule": "نقل وتقليل فتحة الحاء والألف"
  }
],
  "البقرة": [
  {
    "ayah": 2,
    "hafs": "هُدًى",
    "warsh": "هُدًى",
    "rule": "وقفا وجهان: 1. الفتح (كحفص) 2. تقليل فتحة الدال والألف"
  },
  {
    "ayah": 3,
    "hafs": "يُؤْمِنُونَ",
    "warsh": "يُومِنُونَ",
    "rule": "إبدال الهمزة واوا مدية"
  },
  {
    "ayah": 3,
    "hafs": "الصَّلَاةَ",
    "warsh": "الصَّلَوٰةَ",
    "rule": "تغليظ اللام بعد الصاد"
  },
  {
    "ayah": 4,
    "hafs": "يُؤْمِنُونَ",
    "warsh": "يُومِنُونَ",
    "rule": "إبدال الهمزة واوا"
  },
  {
    "ayah": 4,
    "hafs": "وَبِالْآخِرَةِ",
    "warsh": "وَبِالَاخِرَةِ",
    "rule": "نقل حركة الهمزة إلى اللام وحذف الهمزة مع ثلاثة البدل وترقيق الراء"
  },
  {
    "ayah": 5,
    "hafs": "هُدًى",
    "warsh": "هُدًى",
    "rule": "وقفا وجهان: 1. الفتح 2. التقليل"
  },
  {
    "ayah": 6,
    "hafs": "عَلَيْهِمْ",
    "warsh": "عَلَيْهِمُ",
    "rule": "صلة الميم بواو مدية مشبعة"
  },
  {
    "ayah": 6,
    "hafs": "ءَأَنذَرْتَهُمْ",
    "warsh": "ءَأنذَرْتَهُمُ",
    "rule": "وجهان: 1. إبدال الهمزة الثانية ألفا مع المد المشبع وهو المقدم 2. تسهيل الهمزة الثانية مع صلة ميم الجمع بواو مشبعة"
  },
  {
    "ayah": 6,
    "hafs": "يُؤْمِنُونَ",
    "warsh": "يُومِنُونَ",
    "rule": "إبدال الهمزة واوا"
  },
  {
    "ayah": 7,
    "hafs": "أَبْصَارِهِمْ",
    "warsh": "أَبْصَارِهِمْ",
    "rule": "تقليل فتحة الصاد والألف"
  },
  {
    "ayah": 8,
    "hafs": "ءَامَنَّا",
    "warsh": "ءَامَنَّا",
    "rule": "ثلاثة البدل"
  },
  {
    "ayah": 8,
    "hafs": "الْآخِرِ",
    "warsh": "الَاخِرِ",
    "rule": "نقل ثم ثلاثة البدل، وابتداء وجهان: 1. اَلَاخِر 2. لَاخِر"
  },
  {
    "ayah": 8,
    "hafs": "بِمُؤْمِنِينَ",
    "warsh": "بِمُومِنِينَ",
    "rule": "إبدال الهمزة واوا مدية"
  },
  {
    "ayah": 9,
    "hafs": "ءَامَنُوا",
    "warsh": "ءَامَنُوا",
    "rule": "ثلاثة البدل"
  },
  {
    "ayah": 9,
    "hafs": "يَخْدَعُونَ",
    "warsh": "يُخَادِعُونَ",
    "rule": "ضم الياء وفتح الخاء وألف بعدها وكسر الدال"
  },
  {
    "ayah": 10,
    "hafs": "عَذَابٌ أَلِيمٌ",
    "warsh": "عَذَابُ نَلِيمٌ",
    "rule": "نقل حركة الهمزة إلى التنوين"
  },
  {
    "ayah": 10,
    "hafs": "يَكْذِبُونَ",
    "warsh": "يُكَذِّبُونَ",
    "rule": "ضم الياء وفتح الكاف وتشديد الذال"
  },
  {
    "ayah": 11,
    "hafs": "الْأَرْضِ",
    "warsh": "الَارْضِ",
    "rule": "نقل الفتحة إلى اللام وحذف الهمزة"
  },
  {
    "ayah": 13,
    "hafs": "لَهُمْ ءَامِنُوا",
    "warsh": "لَهُمُ ءَامِنُوا",
    "rule": "صلة الميم بواو مدية مشبعة ثم ثلاثة البدل"
  },
  {
    "ayah": 13,
    "hafs": "ءَامَنَ",
    "warsh": "ءَامَنَ",
    "rule": "ثلاثة البدل (الموضعين)"
  },
  {
    "ayah": 13,
    "hafs": "أَنُؤْمِنُ",
    "warsh": "أَنُومِنُ",
    "rule": "إبدال الهمزة واوا مدية"
  },
  {
    "ayah": 13,
    "hafs": "السُّفَهَاءُ أَلَا",
    "warsh": "السُّفَهَاءُ وَلَا",
    "rule": "وصلا إبدال الهمزة الثانية واوا مفتوحة"
  },
  {
    "ayah": 14,
    "hafs": "ءَامَنُوا",
    "warsh": "ءَامَنُوا",
    "rule": "ثلاثة البدل"
  },
  {
    "ayah": 14,
    "hafs": "ءَامَنَّا",
    "warsh": "ءَامَنَّا",
    "rule": "ثلاثة البدل"
  },
  {
    "ayah": 14,
    "hafs": "خَلَوْا إِلَى",
    "warsh": "خَلَوِ إِلَى",
    "rule": "نقل الكسرة إلى الواو"
  },
  {
    "ayah": 14,
    "hafs": "مَعَكُمْ إِنَّمَا",
    "warsh": "مَعَكُمُ إِنَّمَا",
    "rule": "صلة الميم بواو مدية مشبعة"
  },
  {
    "ayah": 14,
    "hafs": "مُسْتَهْزِءُونَ",
    "warsh": "مُسْتَهْزِءُونَ",
    "rule": "بدل وصلا، عارض وقفا"
  },
  {
    "ayah": 16,
    "hafs": "بِالْهُدَى",
    "warsh": "بِالْهُدَى",
    "rule": "وجهان: 1. الفتح 2. التقليل"
  },
  {
    "ayah": 17,
    "hafs": "يُبْصِرُونَ",
    "warsh": "يُبْصِرُونَ",
    "rule": "ترقيق الراء"
  },
  {
    "ayah": 19,
    "hafs": "ءَاذَانِهِم",
    "warsh": "ءَاذَانِهِم",
    "rule": "ثلاثة البدل"
  },
  {
    "ayah": 19,
    "hafs": "بِالْكَافِرِينَ",
    "warsh": "بِالْكَافِرِينَ",
    "rule": "تقليل فتحة الكاف والألف"
  },
  {
    "ayah": 20,
    "hafs": "أَظْلَمَ",
    "warsh": "أَظْلَمَ",
    "rule": "تغليظ اللام"
  },
  {
    "ayah": 20,
    "hafs": "وَأَبْصَارِهِمْ",
    "warsh": "وَأَبْصَارِهِمْ",
    "rule": "تقليل فتحة الصاد والألف وصلة الميم"
  },
  {
    "ayah": 20,
    "hafs": "شَيْءٍ",
    "warsh": "شَيْءٍ",
    "rule": "مد لين مهموز يمد 4 أو 6 حركات وصلا ووقفا"
  },
  {
    "ayah": 20,
    "hafs": "قَدِيرٌ",
    "warsh": "قَدِيرٌ",
    "rule": "ترقيق الراء وصلا ووقفا"
  },
  {
    "ayah": 22,
    "hafs": "الْأَرْضَ",
    "warsh": "الَارْضَ",
    "rule": "نقل الفتحة إلى اللام وحذف الهمزة"
  },
  {
    "ayah": 22,
    "hafs": "فِرَاشًا",
    "warsh": "فِرَاشًا",
    "rule": "ترقيق الراء"
  },
  {
    "ayah": 23,
    "hafs": "فَأْتُوا",
    "warsh": "فَاتُوا",
    "rule": "إبدال الهمزة ألفا"
  },
  {
    "ayah": 24,
    "hafs": "لِلْكَافِرِينَ",
    "warsh": "لِلْكَافِرِينَ",
    "rule": "تقليل فتحة الكاف والألف"
  },
  {
    "ayah": 25,
    "hafs": "ءَامَنُوا",
    "warsh": "ءَامَنُوا",
    "rule": "ثلاثة البدل"
  },
  {
    "ayah": 25,
    "hafs": "الْأَنْهَارُ",
    "warsh": "الَانْهَارُ",
    "rule": "نقل الفتحة إلى اللام وحذف الهمزة"
  },
  {
    "ayah": 26,
    "hafs": "ءَامَنُوا",
    "warsh": "ءَامَنُوا",
    "rule": "ثلاثة البدل"
  },
  {
    "ayah": 26,
    "hafs": "كَثِيرًا",
    "warsh": "كَثِيرًا",
    "rule": "ترقيق الراء وصلا ووقفا (الموضعين)"
  },
  {
    "ayah": 27,
    "hafs": "يُوصَلَ",
    "warsh": "يُوصَلَ",
    "rule": "وصلا: تغليظ اللام، وقفا: وجهان"
  },
  {
    "ayah": 27,
    "hafs": "الْأَرْضِ",
    "warsh": "الَارْضِ",
    "rule": "نقل الفتحة إلى اللام وحذف الهمزة"
  },
  {
    "ayah": 27,
    "hafs": "الْخَاسِرُونَ",
    "warsh": "الْخَاسِرُونَ",
    "rule": "ترقيق الراء"
  },
  {
    "ayah": 28,
    "hafs": "وَكُنتُمْ أَمْوَاتًا",
    "warsh": "وَكُنتُمُ أَمْوَاتًا",
    "rule": "صلة الميم بواو مدية مشبعة"
  },
  {
    "ayah": 28,
    "hafs": "فَأَحْيَاكُمْ",
    "warsh": "فَأَحْيَاكُمْ",
    "rule": "1. فتح الياء والألف وهو المقدم 2. التقليل"
  },
  {
    "ayah": 29,
    "hafs": "الْأَرْضِ",
    "warsh": "الَارْضِ",
    "rule": "نقل الفتحة إلى اللام وحذف الهمزة"
  },
  {
    "ayah": 29,
    "hafs": "اسْتَوَى",
    "warsh": "اسْتَوَى",
    "rule": "وجهان: 1. الفتح 2. التقليل"
  },
  {
    "ayah": 29,
    "hafs": "فَسَوَّاهُنَّ",
    "warsh": "فَسَوَّاهُنَّ",
    "rule": "وجهان: 1. الفتح 2. التقليل"
  },
  {
    "ayah": 29,
    "hafs": "شَيْءٍ",
    "warsh": "شَيْءٍ",
    "rule": "توسط أو إشباع اللين"
  },
  {
    "ayah": 30,
    "hafs": "الْأَرْضِ",
    "warsh": "الَارْضِ",
    "rule": "نقل الفتحة إلى اللام وحذف الهمزة"
  },
  {
    "ayah": 30,
    "hafs": "إِنِّي أَعْلَمُ",
    "warsh": "إِنِّيَ أَعْلَمُ",
    "rule": "فتح الياء"
  },
  {
    "ayah": 31,
    "hafs": "ءَادَمَ",
    "warsh": "ءَادَمَ",
    "rule": "ثلاثة البدل"
  },
  {
    "ayah": 31,
    "hafs": "الْأَسْمَاءَ",
    "warsh": "الَاسْمَاءَ",
    "rule": "نقل الفتحة إلى اللام وحذف الهمزة"
  },
  {
    "ayah": 31,
    "hafs": "أَنبِئُونِي",
    "warsh": "أَنبِئُونِي",
    "rule": "ثلاثة البدل"
  },
  {
    "ayah": 31,
    "hafs": "هَٰؤُلَاءِ إِن",
    "warsh": "هَٰؤُلَاءِ إِن",
    "rule": "3 أوجه: 1. إبدال الهمزة الثانية ياء ساكنة مع المد المشبع 2. تسهيل الهمزة الثانية 3. إبدالها ياء مكسورة"
  },
  {
    "ayah": 33,
    "hafs": "يَتَئَادَمُ",
    "warsh": "يَتَئَادَمُ",
    "rule": "ثلاثة البدل"
  },
  {
    "ayah": 33,
    "hafs": "أَلَمْ أَقُل",
    "warsh": "أَلَمَ اَقُل",
    "rule": "نقل الفتحة إلى الميم وحذف الهمزة"
  },
  {
    "ayah": 33,
    "hafs": "لَّكُمْ إِنِّي",
    "warsh": "لَّكُمُ إِنِّي",
    "rule": "صلة الميم بواو مدية مشبعة ثم فتح الياء"
  },
  {
    "ayah": 33,
    "hafs": "وَالْأَرْضِ",
    "warsh": "وَالَارْضِ",
    "rule": "نقل الفتحة إلى اللام وحذف الهمزة"
  },
  {
    "ayah": 34,
    "hafs": "لِآدَمَ",
    "warsh": "لِآدَمَ",
    "rule": "ثلاثة البدل"
  },
  {
    "ayah": 34,
    "hafs": "أَبَى",
    "warsh": "أَبَى",
    "rule": "وجهان: 1. الفتح 2. التقليل"
  },
  {
    "ayah": 34,
    "hafs": "الْكَافِرِينَ",
    "warsh": "الْكَافِرِينَ",
    "rule": "تقليل فتحة الكاف والألف"
  },
  {
    "ayah": 35,
    "hafs": "يَتَئَادَمُ",
    "warsh": "يَتَئَادَمُ",
    "rule": "ثلاثة البدل"
  },
  {
    "ayah": 35,
    "hafs": "اسْكُنْ أَنتَ",
    "warsh": "اسْكُنَ أَنتَ",
    "rule": "نقل الفتحة إلى النون وحذف الهمزة"
  },
  {
    "ayah": 36,
    "hafs": "الْأَرْضِ",
    "warsh": "الَارْضِ",
    "rule": "نقل الفتحة إلى اللام وحذف الهمزة"
  },
  {
    "ayah": 36,
    "hafs": "وَمَتَاعٌ إِلَى",
    "warsh": "وَمَتَاعُ إِلَى",
    "rule": "نقل الكسر إلى التنوين وحذف الهمزة"
  },
  {
    "ayah": 37,
    "hafs": "فَتَلَقَّى",
    "warsh": "فَتَلَقَّى",
    "rule": "وجهان: 1. الفتح 2. التقليل"
  },
  {
    "ayah": 37,
    "hafs": "ءَادَمُ",
    "warsh": "ءَادَمُ",
    "rule": "ثلاثة البدل"
  },
  {
    "ayah": 38,
    "hafs": "يَأْتِيَنَّكُم",
    "warsh": "يَاتِيَنَّكُم",
    "rule": "إبدال الهمزة ألفا"
  },
  {
    "ayah": 38,
    "hafs": "هُدًى",
    "warsh": "هُدًى",
    "rule": "وقفا: وجهان: 1. الفتح 2. التقليل"
  },
  {
    "ayah": 38,
    "hafs": "هُدَايَ",
    "warsh": "هُدَايَ",
    "rule": "وجهان: 1. الفتح 2. التقليل"
  },
  {
    "ayah": 39,
    "hafs": "بِآيَاتِنَا",
    "warsh": "بِآيَاتِنَا",
    "rule": "ثلاثة البدل"
  },
  {
    "ayah": 39,
    "hafs": "النَّارِ",
    "warsh": "النَّارِ",
    "rule": "تقليل ثم ترقيق الراء وصلا ووقفا"
  },
  {
    "ayah": 40,
    "hafs": "أَوْفِ",
    "warsh": "أَوْفِ",
    "rule": "ثلاثة البدل"
  },
  {
    "ayah": 41,
    "hafs": "وَءَامِنُوا",
    "warsh": "وَءَامِنُوا",
    "rule": "ثلاثة البدل"
  },
  {
    "ayah": 41,
    "hafs": "بِآيَاتِي",
    "warsh": "بِآيَاتِي",
    "rule": "ثلاثة البدل"
  },
  {
    "ayah": 43,
    "hafs": "الصَّلَاةَ",
    "warsh": "الصَّلَوٰةَ",
    "rule": "تغليظ اللام بعد الصاد"
  },
  {
    "ayah": 43,
    "hafs": "وَءَاتُوا",
    "warsh": "وَءَاتُوا",
    "rule": "ثلاثة البدل"
  },
  {
    "ayah": 44,
    "hafs": "أَتَأْمُرُونَ",
    "warsh": "أَتَامُرُونَ",
    "rule": "إبدال الهمزة ألفا"
  },
  {
    "ayah": 45,
    "hafs": "وَالصَّلَاةِ",
    "warsh": "وَالصَّلَوٰةِ",
    "rule": "تغليظ اللام بعد الصاد"
  },
  {
    "ayah": 45,
    "hafs": "لَكَبِيرَةٌ إِلَّا",
    "warsh": "لَكَبِيرَةُ إِلَّا",
    "rule": "ترقيق الراء ثم نقل"
  },
  {
    "ayah": 46,
    "hafs": "وَأَنَّهُمْ إِلَيْهِ",
    "warsh": "وَأَنَّهُمُ إِلَيْهِ",
    "rule": "صلة الميم بواو مدية مشبعة"
  },
  {
    "ayah": 48,
    "hafs": "شَيْئًا",
    "warsh": "شَيْئًا",
    "rule": "توسط أو إشباع اللين"
  },
  {
    "ayah": 48,
    "hafs": "يُؤْخَذُ",
    "warsh": "يُوخَذُ",
    "rule": "إبدال الهمزة واوا"
  },
  {
    "ayah": 49,
    "hafs": "مِنْ ءَالِ",
    "warsh": "مِنَ ءَالِ",
    "rule": "نقل مع ثلاثة البدل"
  },
  {
    "ayah": 50,
    "hafs": "ءَالَ",
    "warsh": "ءَالَ",
    "rule": "ثلاثة البدل"
  },
  {
    "ayah": 51,
    "hafs": "مُوسَى",
    "warsh": "مُوسَى",
    "rule": "وجهان: 1. الفتح 2. التقليل"
  },
  {
    "ayah": 51,
    "hafs": "اتَّخَذْتُمُ",
    "warsh": "اتَّخَذتُّمُ",
    "rule": "إدغام الذال في التاء"
  },
  {
    "ayah": 53,
    "hafs": "وَإِذْ ءَاتَيْنَا",
    "warsh": "وَإِذَ ءَاتَيْنَا",
    "rule": "نقل ثم ثلاثة البدل"
  },
  {
    "ayah": 53,
    "hafs": "مُوسَى",
    "warsh": "مُوسَى",
    "rule": "وقفا: وجهان: 1. الفتح 2. التقليل"
  },
  {
    "ayah": 54,
    "hafs": "مُوسَى",
    "warsh": "مُوسَى",
    "rule": "وجهان: 1. الفتح 2. التقليل"
  },
  {
    "ayah": 54,
    "hafs": "ظَلَمْتُمْ",
    "warsh": "ظَلَمْتُمْ",
    "rule": "تغليظ اللام وضم الميم وصلتها"
  },
  {
    "ayah": 54,
    "hafs": "خَيْرٌ",
    "warsh": "خَيْرٌ",
    "rule": "ترقيق الراء وصلا ووقفا"
  },
  {
    "ayah": 54,
    "hafs": "عَلَيْكُمْ إِنَّهُ",
    "warsh": "عَلَيْكُمُ إِنَّهُ",
    "rule": "صلة الميم بواو مدية مشبعة"
  },
  {
    "ayah": 55,
    "hafs": "يَمُوسَى",
    "warsh": "يَمُوسَى",
    "rule": "وجهان: 1. الفتح 2. التقليل"
  },
  {
    "ayah": 55,
    "hafs": "نُؤْمِنَ",
    "warsh": "نُومِنَ",
    "rule": "إبدال الهمزة واوا"
  },
  {
    "ayah": 55,
    "hafs": "نَرَى",
    "warsh": "نَرَى",
    "rule": "تقليل فتحة الراء والألف وقفا"
  },
  {
    "ayah": 57,
    "hafs": "وَظَلَّلْنَا",
    "warsh": "وَظَلَّلْنَا",
    "rule": "تغليظ اللام بعد الظاء"
  },
  {
    "ayah": 57,
    "hafs": "وَالسَّلْوَى",
    "warsh": "وَالسَّلْوَى",
    "rule": "وجهان: 1. الفتح 2. التقليل"
  },
  {
    "ayah": 57,
    "hafs": "ظَلَمُونَا",
    "warsh": "ظَلَمُونَا",
    "rule": "تغليظ اللام"
  },
  {
    "ayah": 58,
    "hafs": "نَغْفِرْ",
    "warsh": "يُغْفَرْ",
    "rule": "بالياء المضمومة بدل النون، وفتح الفاء"
  },
  {
    "ayah": 58,
    "hafs": "خَطَايَاكُمْ",
    "warsh": "خَطَايَاكُمْ",
    "rule": "وجهان: 1. الفتح 2. التقليل"
  },
  {
    "ayah": 59,
    "hafs": "ظَلَمُوا",
    "warsh": "ظَلَمُوا",
    "rule": "تغليظ اللام ( الموضعين )"
  },
  {
    "ayah": 59,
    "hafs": "غَيْرَ",
    "warsh": "غَيْرَ",
    "rule": "ترقيق الراء وصلا ووقفا"
  },
  {
    "ayah": 60,
    "hafs": "اسْتَسْقَى",
    "warsh": "اسْتَسْقَى",
    "rule": "وجهان: 1. الفتح 2. التقليل"
  },
  {
    "ayah": 60,
    "hafs": "مُوسَى",
    "warsh": "مُوسَى",
    "rule": "وجهان: 1. الفتح 2. التقليل"
  },
  {
    "ayah": 60,
    "hafs": "الْأَرْضِ",
    "warsh": "الَارْضِ",
    "rule": "نقل الفتحة إلى اللام وحذف الهمزة"
  },
  {
    "ayah": 61,
    "hafs": "يَمُوسَى",
    "warsh": "يَمُوسَى",
    "rule": "وجهان: 1. الفتح 2. التقليل"
  },
  {
    "ayah": 61,
    "hafs": "نَصْبِرَ",
    "warsh": "نَصْبِرَ",
    "rule": "ترقيق الراء وصلا ووقفا"
  },
  {
    "ayah": 61,
    "hafs": "الْأَرْضُ",
    "warsh": "الَارْضُ",
    "rule": "نقل الفتحة إلى اللام وحذف الهمزة"
  },
  {
    "ayah": 61,
    "hafs": "أَدْنَى",
    "warsh": "أَدْنَى",
    "rule": "وجهان: 1. الفتح 2. التقليل"
  },
  {
    "ayah": 61,
    "hafs": "خَيْرٌ اهْبِطُوا",
    "warsh": "خَيْرُ اهْبِطُوا",
    "rule": "ترقيق الراء وصلا ووقفا"
  },
  {
    "ayah": 61,
    "hafs": "وَبَاءُو",
    "warsh": "وَبَاءُو",
    "rule": "ثلاثة البدل"
  },
  {
    "ayah": 61,
    "hafs": "بِآيَاتِ",
    "warsh": "بِآيَاتِ",
    "rule": "ثلاثة البدل"
  },
  {
    "ayah": 61,
    "hafs": "النَّبِيِّينَ",
    "warsh": "النَّبِيِّئِينَ",
    "rule": "ياء ساكنة ممدودة ثم همزة (بدل الياء المشددة) مع المد المتصل ثم ثلاثة البدل"
  },
  {
    "ayah": 62,
    "hafs": "ءَامَنُوا",
    "warsh": "ءَامَنُوا",
    "rule": "ثلاثة البدل"
  },
  {
    "ayah": 62,
    "hafs": "وَالنَّصَارَى",
    "warsh": "وَالنَّصَارَى",
    "rule": "تقليل فتحة الراء والألف"
  },
  {
    "ayah": 62,
    "hafs": "وَالصَّابِئِينَ",
    "warsh": "وَالصَّابِينَ",
    "rule": "حذف الهمزة"
  },
  {
    "ayah": 62,
    "hafs": "مَنْ ءَامَنَ",
    "warsh": "مَنَ ءَامَنَ",
    "rule": "نقل ثم ثلاثة البدل"
  },
  {
    "ayah": 62,
    "hafs": "الْآخِرِ",
    "warsh": "الَاخِرِ",
    "rule": "نقل ثم ثلاثة البدل"
  },
  {
    "ayah": 62,
    "hafs": "فَلَهُمْ أَجْرُهُمْ",
    "warsh": "فَلَهُمُ أَجْرُهُمْ",
    "rule": "صلة الميم بواو مدية مشبعة"
  },
  {
    "ayah": 63,
    "hafs": "وَإِذْ أَخَذْنَا",
    "warsh": "وَإِذَ أَخَذْنَا",
    "rule": "النقل"
  },
  {
    "ayah": 63,
    "hafs": "ءَاتَيْنَاكُم",
    "warsh": "ءَاتَيْنَاكُم",
    "rule": "ثلاثة البدل"
  },
  {
    "ayah": 65,
    "hafs": "قِرَدَةً",
    "warsh": "قِرَدَةً",
    "rule": "ترقيق الراء"
  },
  {
    "ayah": 65,
    "hafs": "خَاسِئِينَ",
    "warsh": "خَاسِئِينَ",
    "rule": "اجتمع بدل وعارض للسكون"
  },
  {
    "ayah": 67,
    "hafs": "مُوسَى",
    "warsh": "مُوسَى",
    "rule": "وجهان: 1. الفتح 2. التقليل"
  },
  {
    "ayah": 67,
    "hafs": "يَأْمُرُكُمْ",
    "warsh": "يَامُرُكُمْ",
    "rule": "إبدال الهمزة ألفا مع الصلة"
  },
  {
    "ayah": 67,
    "hafs": "هُزُوًا",
    "warsh": "هُزُؤًا",
    "rule": "إبدال الواو همزة مفتوحة"
  },
  {
    "ayah": 67,
    "hafs": "أَنْ أَكُونَ",
    "warsh": "أَنَ أَكُونَ",
    "rule": "نقل الفتحة إلى النون وحذف الهمز"
  },
  {
    "ayah": 68,
    "hafs": "وَلَا بِكْرٌ",
    "warsh": "وَلَا بِكْرٌ",
    "rule": "ترقيق الراء"
  },
  {
    "ayah": 68,
    "hafs": "تُؤْمَرُونَ",
    "warsh": "تُومَرُونَ",
    "rule": "إبدال الهمزة واوا مدية"
  },
  {
    "ayah": 71,
    "hafs": "تُثِيرُ",
    "warsh": "تُثِيرُ",
    "rule": "ترقيق الراء"
  },
  {
    "ayah": 71,
    "hafs": "الْأَرْضَ",
    "warsh": "الَارْضَ",
    "rule": "نقل الفتحة إلى اللام وحذف الهمزة"
  },
  {
    "ayah": 71,
    "hafs": "الْآنَ",
    "warsh": "الَانَ",
    "rule": "نقل ثم ثلاثة البدل"
  },
  {
    "ayah": 73,
    "hafs": "الْمَوْتَى",
    "warsh": "الْمَوْتَى",
    "rule": "وجهان: 1. الفتح 2. التقليل"
  },
  {
    "ayah": 73,
    "hafs": "وَيُرِيكُمْ",
    "warsh": "وَيُرِيكُمُ",
    "rule": "صلة الميم بواو مدية مشبعة مع ثلاثة البدل"
  },
  {
    "ayah": 73,
    "hafs": "ءَايَاتِهِ",
    "warsh": "ءَايَاتِهِ",
    "rule": "مع ثلاثة البدل"
  },
  {
    "ayah": 74,
    "hafs": "أَوْ أَشَدُّ",
    "warsh": "أَوَ أَشَدُّ",
    "rule": "نقل الفتحة إلى الواو وحذف الهمزة"
  },
  {
    "ayah": 74,
    "hafs": "الْأَنْهَارُ",
    "warsh": "الَانْهَارُ",
    "rule": "نقل الفتحة إلى اللام وحذف الهمزة"
  },
  {
    "ayah": 75,
    "hafs": "يُؤْمِنُوا",
    "warsh": "يُومِنُوا",
    "rule": "إبدال الهمزة واوا"
  },
  {
    "ayah": 76,
    "hafs": "ءَامَنُوا",
    "warsh": "ءَامَنُوا",
    "rule": "ثلاثة البدل"
  },
  {
    "ayah": 76,
    "hafs": "ءَامَنَّا",
    "warsh": "ءَامَنَّا",
    "rule": "ثلاثة البدل"
  },
  {
    "ayah": 76,
    "hafs": "بَعْضُهُمْ إِلَى",
    "warsh": "بَعْضُهُمُ إِلَى",
    "rule": "صلة الميم بواو مدية مشبعة"
  },
  {
    "ayah": 76,
    "hafs": "رَبِّكُمْ أَفَلَا",
    "warsh": "رَبِّكُمُ أَفَلَا",
    "rule": "صلة الميم بواو مدية مشبعة"
  },
  {
    "ayah": 77,
    "hafs": "يُسِرُّونَ",
    "warsh": "يُسِرُّونَ",
    "rule": "ترقيق الراء"
  },
  {
    "ayah": 78,
    "hafs": "وَمِنْهُمْ أُمِّيُّونَ",
    "warsh": "وَمِنْهُمُ أُمِّيُّونَ",
    "rule": "صلة الميم بواو مدية مشبعة"
  },
  {
    "ayah": 78,
    "hafs": "هُمْ إِلَّا",
    "warsh": "هُمُ إِلَّا",
    "rule": "صلة الميم بواو مدية مشبعة"
  },
  {
    "ayah": 79,
    "hafs": "كَتَبَتْ",
    "warsh": "كَتَبَتْ",
    "rule": "نقل الفتحة إلى التاء وحذف الهمزة"
  },
  {
    "ayah": 79,
    "hafs": "أَيْدِيهِمْ",
    "warsh": "أَيْدِيهِمْ",
    "rule": "نقل الفتحة إلى التاء وحذف الهمزة"
  },
  {
    "ayah": 80,
    "hafs": "قُلْ أَتَّخَذْتُمْ",
    "warsh": "قُلَ اتَّخَذتُّمْ",
    "rule": "نقل ثم إدغام الذال في التاء"
  },
  {
    "ayah": 81,
    "hafs": "بَلَى",
    "warsh": "بَلَى",
    "rule": "وجهان: 1. الفتح 2. التقليل"
  },
  {
    "ayah": 81,
    "hafs": "خَطِيئَتُهُ",
    "warsh": "خَطِيئَاتُهُ",
    "rule": "ألف بعد الهمزة (بالجمع) ثم ثلاثة البدل"
  },
  {
    "ayah": 81,
    "hafs": "النَّارِ",
    "warsh": "النَّارِ",
    "rule": "تقليل وترقيق الراء وصلا ووقفا"
  },
  {
    "ayah": 82,
    "hafs": "ءَامَنُوا",
    "warsh": "ءَامَنُوا",
    "rule": "ثلاثة البدل"
  },
  {
    "ayah": 83,
    "hafs": "وَإِذْ أَخَذْنَا",
    "warsh": "وَإِذَ أَخَذْنَا",
    "rule": "نقل الفتحة إلى الذال وحذف الهمزة"
  },
  {
    "ayah": 83,
    "hafs": "الْقُرْبَى وَالْيَتَامَى",
    "warsh": "الْقُرْبَى وَالْيَتَامَى",
    "rule": "وجهان: 1. الفتح 2. التقليل"
  },
  {
    "ayah": 83,
    "hafs": "الصَّلَاةَ",
    "warsh": "الصَّلَوٰةَ",
    "rule": "تغليظ اللام بعد الصاد"
  },
  {
    "ayah": 83,
    "hafs": "وَءَاتُوا",
    "warsh": "وَءَاتُوا",
    "rule": "ثلاثة البدل"
  },
  {
    "ayah": 83,
    "hafs": "تَوَلَّيْتُمْ إِلَّا",
    "warsh": "تَوَلَّيْتُمُ إِلَّا",
    "rule": "صلة الميم بواو مدية مشبعة"
  },
  {
    "ayah": 84,
    "hafs": "وَإِذْ أَخَذْنَا",
    "warsh": "وَإِذَ أَخَذْنَا",
    "rule": "نقل الفتحة إلى الذال وحذف الهمزة"
  },
  {
    "ayah": 84,
    "hafs": "دِيَارِكُم",
    "warsh": "دِيَارِكُم",
    "rule": "تقليل فتحة الياء والألف"
  },
  {
    "ayah": 85,
    "hafs": "دِيَارِهِمْ",
    "warsh": "دِيَارِهِمْ",
    "rule": "تقليل فتحة الياء والألف"
  },
  {
    "ayah": 85,
    "hafs": "تَظَاهَرُونَ",
    "warsh": "تَظَّاهَرُونَ",
    "rule": "تشديد الظاء"
  }
]
};
